{
  "es": {
    "version": "1.0.0",
    "privacy_policy_title": "Política de Privacidad",
    "privacy_policy_intro": "En Café Sabrosos, respetamos tu privacidad y estamos comprometidos a proteger tus datos personales. Esta Política de Privacidad explica cómo recopilamos, usamos y protegemos tu información cuando utilizas nuestra aplicación web.",
    "info_section": "1. Información que Recopilamos",
    "paragraph_1": "Recopilamos información personal que nos proporcionas directamente, como tu nombre, dirección de correo electrónico y detalles de contacto. Si eliges registrarte mediante proveedores externos como Google, también recopilaremos información proporcionada por estos, como tu UID, correo electrónico y foto de perfil.",
    "use_section": "2. Uso de la Información",
    "paragraph_2": "Utilizamos la información que recopilamos para procesar tus pedidos, mejorar nuestros servicios y comunicarnos contigo. También podemos usar tus datos para enviarte actualizaciones y promociones relacionadas con Café Sabrosos.",
    "cookies_section": "3. Uso de Cookies",
    "paragraph_3": "En nuestra aplicación web utilizamos cookies para mejorar tu experiencia. Las cookies son pequeños archivos de texto que se almacenan en tu dispositivo cuando visitas nuestro sitio. Estas nos permiten recordar información sobre tu sesión, como tus preferencias de idioma y los productos que has agregado a tu carrito.",
    "paragraph_4": "Al continuar navegando en nuestro sitio, aceptas el uso de cookies. Puedes optar por desactivar las cookies en cualquier momento a través de la configuración de tu navegador, pero esto puede afectar la funcionalidad de nuestra aplicación.",
    "sharing_section": "4. Compartición de Información",
    "paragraph_5": "No compartimos tu información personal con terceros, excepto cuando sea necesario para procesar tus pedidos o cumplir con las leyes aplicables. Si utilizas proveedores externos para registrarte, tu información puede ser gestionada por esos servicios, y te recomendamos revisar sus políticas de privacidad.",
    "security_section": "5. Seguridad de la Información",
    "paragraph_6": "Implementamos medidas de seguridad para proteger tu información personal contra el acceso no autorizado, la alteración, divulgación o destrucción. Sin embargo, ningún sistema es completamente seguro, y no podemos garantizar la seguridad absoluta de tus datos.",
    "rights_section": "6. Tus Derechos",
    "paragraph_7": "Tienes derecho a acceder, corregir o eliminar tu información personal que tenemos sobre ti. Si deseas ejercer estos derechos, por favor contáctanos utilizando la información de contacto proporcionada a continuación.",
    "changes_section": "7. Cambios en la Política",
    "changes_paragraph": "Podemos actualizar esta Política de Privacidad de vez en cuando. Cualquier cambio se publicará en esta página, y tu uso continuo de nuestra aplicación web constituye aceptación de la política actualizada.",
    "contact_section": "8. Información de Contacto",
    "contact_paragraph": "Si tienes alguna pregunta o inquietud sobre nuestra Política de Privacidad, por favor contáctanos en soporte@cafesabrosos.com."
  },
  "en": {
    "version": "1.0.0",
    "privacy_policy_title": "Privacy Policy",
    "privacy_policy_intro": "At Café Sabrosos, we respect your privacy and are committed to protecting your personal data. This Privacy Policy explains how we collect, use, and protect your information when you use our web application.",
    "info_section": "1. Information We Collect",
    "paragraph_1": "We collect personal information that you provide directly, such as your name, email address, and contact details. If you choose to register using external providers like Google, we will also collect information provided by them, such as your UID, email address, and profile picture.",
    "use_section": "2. Use of Information",
    "paragraph_2": "We use the information we collect to process your orders, improve our services, and communicate with you. We may also use your data to send you updates and promotions related to Café Sabrosos.",
    "cookies_section": "3. Use of Cookies",
    "paragraph_3": "In our web application, we use cookies to enhance your experience. Cookies are small text files stored on your device when you visit our site. They allow us to remember information about your session, such as your language preferences and the products you have added to your cart.",
    "paragraph_4": "By continuing to browse our site, you accept the use of cookies. You can choose to disable cookies at any time through your browser settings, but this may affect the functionality of our application.",
    "sharing_section": "4. Sharing of Information",
    "paragraph_5": "We do not share your personal information with third parties except when necessary to process your orders or comply with applicable laws. If you use external providers to register, your information may be managed by those services, and we recommend reviewing their privacy policies.",
    "security_section": "5. Security of Information",
    "paragraph_6": "We implement security measures to protect your personal information against unauthorized access, alteration, disclosure, or destruction. However, no system is completely secure, and we cannot guarantee the absolute security of your data.",
    "rights_section": "6. Your Rights",
    "paragraph_7": "You have the right to access, correct, or delete your personal information that we have about you. If you wish to exercise these rights, please contact us using the contact information provided below.",
    "changes_section": "7. Changes to the Policy",
    "changes_paragraph": "We may update this Privacy Policy from time to time. Any changes will be posted on this page, and your continued use of our web application constitutes acceptance of the updated policy.",
    "contact_section": "8. Contact Information",
    "contact_paragraph": "If you have any questions or concerns about our Privacy Policy, please contact us at soporte@cafesabrosos.com."
  },
  "pt": {
    "version": "1.0.0",
    "privacy_policy_title": "Política de Privacidade",
    "privacy_policy_intro": "No Café Sabrosos, respeitamos a sua privacidade e estamos comprometidos em proteger seus dados pessoais. Esta Política de Privacidade explica como coletamos, usamos e protegemos suas informações ao usar nosso aplicativo web.",
    "info_section": "1. Informações que Coletamos",
    "paragraph_1": "Coletamos informações pessoais que você nos fornece diretamente, como seu nome, endereço de e-mail e detalhes de contato. Se você optar por se registrar usando provedores externos como o Google, também coletaremos informações fornecidas por eles, como seu UID, endereço de e-mail e foto de perfil.",
    "use_section": "2. Uso das Informações",
    "paragraph_2": "Usamos as informações que coletamos para processar seus pedidos, melhorar nossos serviços e nos comunicarmos com você. Também podemos usar seus dados para enviar atualizações e promoções relacionadas ao Café Sabrosos.",
    "cookies_section": "3. Uso de Cookies",
    "paragraph_3": "Em nosso aplicativo web, usamos cookies para melhorar sua experiência. Cookies são pequenos arquivos de texto armazenados em seu dispositivo quando você visita nosso site. Eles nos permitem lembrar informações sobre sua sessão, como suas preferências de idioma e os produtos que você adicionou ao seu carrinho.",
    "paragraph_4": "Ao continuar navegando em nosso site, você aceita o uso de cookies. Você pode optar por desativar os cookies a qualquer momento nas configurações do seu navegador, mas isso pode afetar a funcionalidade do nosso aplicativo.",
    "sharing_section": "4. Compartilhamento de Informações",
    "paragraph_5": "Não compartilhamos suas informações pessoais com terceiros, exceto quando necessário para processar seus pedidos ou cumprir as leis aplicáveis. Se você usar provedores externos para se registrar, suas informações podem ser geridas por esses serviços, e recomendamos que você revise suas políticas de privacidade.",
    "security_section": "5. Segurança das Informações",
    "paragraph_6": "Implementamos medidas de segurança para proteger suas informações pessoais contra acesso não autorizado, alteração, divulgação ou destruição. No entanto, nenhum sistema é completamente seguro e não podemos garantir a segurança absoluta de seus dados.",
    "rights_section": "6. Seus Direitos",
    "paragraph_7": "Você tem o direito de acessar, corrigir ou excluir suas informações pessoais que temos sobre você. Se você deseja exercer esses direitos, entre em contato conosco usando as informações de contato fornecidas abaixo.",
    "changes_section": "7. Mudanças na Política",
    "changes_paragraph": "Podemos atualizar esta Política de Privacidade de tempos em tempos. Quaisquer alterações serão publicadas nesta página e o uso contínuo do nosso aplicativo web constitui aceitação da política atualizada.",
    "contact_section": "8. Informações de Contato",
    "contact_paragraph": "Se você tiver alguma dúvida ou preocupação sobre nossa Política de Privacidade, entre em contato conosco em suporte@cafesabrosos.com."
  },
  "fr": {
    "version": "1.0.0",
    "privacy_policy_title": "Politique de Confidentialité",
    "privacy_policy_intro": "Chez Café Sabrosos, nous respectons votre vie privée et nous nous engageons à protéger vos données personnelles. Cette Politique de Confidentialité explique comment nous collectons, utilisons et protégeons vos informations lorsque vous utilisez notre application web.",
    "info_section": "1. Informations que Nous Collectons",
    "paragraph_1": "Nous collectons des informations personnelles que vous nous fournissez directement, telles que votre nom, votre adresse e-mail et vos coordonnées. Si vous choisissez de vous inscrire via des fournisseurs externes comme Google, nous collecterons également des informations fournies par eux, telles que votre UID, votre adresse e-mail et votre photo de profil.",
    "use_section": "2. Utilisation des Informations",
    "paragraph_2": "Nous utilisons les informations que nous collectons pour traiter vos commandes, améliorer nos services et communiquer avec vous. Nous pouvons également utiliser vos données pour vous envoyer des mises à jour et des promotions liées à Café Sabrosos.",
    "cookies_section": "3. Utilisation des Cookies",
    "paragraph_3": "Dans notre application web, nous utilisons des cookies pour améliorer votre expérience. Les cookies sont de petits fichiers texte stockés sur votre appareil lorsque vous visitez notre site. Ils nous permettent de nous souvenir des informations sur votre session, telles que vos préférences linguistiques et les produits que vous avez ajoutés à votre panier.",
    "paragraph_4": "En continuant à naviguer sur notre site, vous acceptez l'utilisation des cookies. Vous pouvez choisir de désactiver les cookies à tout moment dans les paramètres de votre navigateur, mais cela peut affecter la fonctionnalité de notre application.",
    "sharing_section": "4. Partage d'Informations",
    "paragraph_5": "Nous ne partageons pas vos informations personnelles avec des tiers, sauf si nécessaire pour traiter vos commandes ou respecter les lois applicables. Si vous utilisez des fournisseurs externes pour vous inscrire, vos informations peuvent être gérées par ces services, et nous vous recommandons de consulter leurs politiques de confidentialité.",
    "security_section": "5. Sécurité des Informations",
    "paragraph_6": "Nous mettons en œuvre des mesures de sécurité pour protéger vos informations personnelles contre l'accès non autorisé, la modification, la divulgation ou la destruction. Cependant, aucun système n'est complètement sûr, et nous ne pouvons pas garantir la sécurité absolue de vos données.",
    "rights_section": "6. Vos Droits",
    "paragraph_7": "Vous avez le droit d'accéder, de corriger ou de supprimer vos informations personnelles que nous avons sur vous. Si vous souhaitez exercer ces droits, veuillez nous contacter en utilisant les informations de contact fournies ci-dessous.",
    "changes_section": "7. Changements dans la Politique",
    "changes_paragraph": "Nous pouvons mettre à jour cette Politique de Confidentialité de temps à autre. Toute modification sera publiée sur cette page, et votre utilisation continue de notre application web constitue l'acceptation de la politique mise à jour.",
    "contact_section": "8. Informations de Contact",
    "contact_paragraph": "Si vous avez des questions ou des préoccupations concernant notre Politique de Confidentialité, veuillez nous contacter à soutien@cafesabrosos.com."
  },
  "de": {
    "version": "1.0.0",
    "privacy_policy_title": "Datenschutzrichtlinie",
    "privacy_policy_intro": "Bei Café Sabrosos respektieren wir Ihre Privatsphäre und verpflichten uns, Ihre personenbezogenen Daten zu schützen. Diese Datenschutzrichtlinie erklärt, wie wir Ihre Informationen erfassen, verwenden und schützen, wenn Sie unsere Webanwendung nutzen.",
    "info_section": "1. Informationen, die wir Erfassen",
    "paragraph_1": "Wir erfassen personenbezogene Informationen, die Sie uns direkt zur Verfügung stellen, wie Ihren Namen, Ihre E-Mail-Adresse und Kontaktdaten. Wenn Sie sich entscheiden, sich über externe Anbieter wie Google zu registrieren, erfassen wir auch Informationen, die von diesen bereitgestellt werden, wie Ihre UID, E-Mail-Adresse und Profilbild.",
    "use_section": "2. Verwendung von Informationen",
    "paragraph_2": "Wir verwenden die Informationen, die wir sammeln, um Ihre Bestellungen zu verarbeiten, unsere Dienstleistungen zu verbessern und mit Ihnen zu kommunizieren. Wir können Ihre Daten auch verwenden, um Ihnen Updates und Werbeaktionen im Zusammenhang mit Café Sabrosos zu senden.",
    "cookies_section": "3. Verwendung von Cookies",
    "paragraph_3": "In unserer Webanwendung verwenden wir Cookies, um Ihre Erfahrung zu verbessern. Cookies sind kleine Textdateien, die auf Ihrem Gerät gespeichert werden, wenn Sie unsere Website besuchen. Sie ermöglichen es uns, Informationen über Ihre Sitzung zu speichern, wie Ihre Spracheinstellungen und die Produkte, die Sie Ihrem Warenkorb hinzugefügt haben.",
    "paragraph_4": "Indem Sie weiterhin auf unserer Website surfen, akzeptieren Sie die Verwendung von Cookies. Sie können Cookies jederzeit in den Einstellungen Ihres Browsers deaktivieren, aber dies kann die Funktionalität unserer Anwendung beeinträchtigen.",
    "sharing_section": "4. Teilen von Informationen",
    "paragraph_5": "Wir geben Ihre personenbezogenen Informationen nicht an Dritte weiter, es sei denn, dies ist erforderlich, um Ihre Bestellungen zu verarbeiten oder die geltenden Gesetze einzuhalten. Wenn Sie externe Anbieter zur Registrierung nutzen, können Ihre Informationen von diesen Diensten verwaltet werden, und wir empfehlen Ihnen, deren Datenschutzrichtlinien zu überprüfen.",
    "security_section": "5. Sicherheit von Informationen",
    "paragraph_6": "Wir setzen Sicherheitsmaßnahmen ein, um Ihre personenbezogenen Daten vor unbefugtem Zugriff, Veränderung, Offenlegung oder Zerstörung zu schützen. Allerdings ist kein System völlig sicher, und wir können die absolute Sicherheit Ihrer Daten nicht garantieren.",
    "rights_section": "6. Ihre Rechte",
    "paragraph_7": "Sie haben das Recht, auf Ihre personenbezogenen Daten zuzugreifen, diese zu korrigieren oder zu löschen, die wir über Sie haben. Wenn Sie diese Rechte ausüben möchten, kontaktieren Sie uns bitte unter den unten angegebenen Kontaktdaten.",
    "changes_section": "7. Änderungen an der Richtlinie",
    "changes_paragraph": "Wir können diese Datenschutzrichtlinie von Zeit zu Zeit aktualisieren. Änderungen werden auf dieser Seite veröffentlicht, und Ihre fortgesetzte Nutzung unserer Webanwendung stellt die Akzeptanz der aktualisierten Richtlinie dar.",
    "contact_section": "8. Kontaktinformationen",
    "contact_paragraph": "Wenn Sie Fragen oder Bedenken zu unserer Datenschutzrichtlinie haben, kontaktieren Sie uns bitte unter unterstützung@cafesabrosos.com."
  }
}
