{
  "es": {
    "version": "1.0.0",
    "terms_conditions_title": "Términos y Condiciones",
    "terms_conditions_intro": "¡Bienvenido a Café Sabrosos! Estos Términos y Condiciones establecen las reglas y regulaciones para el uso de nuestra aplicación web. Al acceder o utilizar nuestra aplicación web, aceptas cumplir con estos términos.",
    "terms_conditions_section_1": "1. Introducción",
    "terms_conditions_paragraph_1": "Estos Términos y Condiciones rigen tu uso de nuestra aplicación web para realizar pedidos en Café Sabrosos. Si no estás de acuerdo con alguna parte de estos términos, no debes utilizar nuestra aplicación web.",
    "terms_conditions_section_2": "2. Registro de Cuenta",
    "terms_conditions_paragraph_2": "Para utilizar ciertas funciones de nuestra aplicación web, es posible que necesites crear una cuenta. Eres responsable de mantener la confidencialidad de la información de tu cuenta y de todas las actividades que ocurran bajo tu cuenta. También puedes registrarte utilizando proveedores externos como Google. Al hacerlo, aceptas que recopilemos y usemos la información proporcionada por dicho proveedor, de acuerdo con nuestra Política de Privacidad.",
    "terms_conditions_section_3": "3. Pedidos y Pagos",
    "terms_conditions_paragraph_3": "Al realizar un pedido, aceptas proporcionar información precisa sobre los artículos que deseas comprar y tus datos de contacto. Los pagos deben realizarse de acuerdo con los métodos de pago disponibles. Nos reservamos el derecho de cancelar cualquier pedido si sospechamos actividad fraudulenta.",
    "terms_conditions_section_4": "4. Recogida de Pedidos",
    "terms_conditions_paragraph_4": "Si eliges recoger tu pedido, por favor hazlo a la hora especificada. Café Sabrosos no se hace responsable de retrasos o problemas con el proceso de recogida.",
    "terms_conditions_section_5": "5. Cancelaciones y Modificaciones",
    "terms_conditions_paragraph_5": "Los pedidos pueden ser modificados o cancelados antes de que comience la preparación. Una vez que un pedido está en preparación, no puede ser cancelado ni modificado. Por favor, contacta con nosotros lo antes posible si necesitas hacer cambios.",
    "terms_conditions_section_6": "6. Conducta del Usuario",
    "terms_conditions_paragraph_6": "Aceptas utilizar nuestra aplicación web de manera legal y no participar en ninguna actividad que pueda dañar nuestros servicios, interrumpir la experiencia del usuario o violar las leyes aplicables.",
    "terms_conditions_section_7": "7. Política de Privacidad",
    "terms_conditions_paragraph_7": "Tu privacidad es importante para nosotros. Por favor, revisa nuestra Política de Privacidad para entender cómo recopilamos, usamos y protegemos tu información personal.",
    "terms_conditions_section_8": "8. Cambios en los Términos",
    "terms_conditions_paragraph_8": "Podemos actualizar estos Términos y Condiciones de vez en cuando. Cualquier cambio se publicará en esta página, y tu uso continuo de nuestra aplicación web constituye aceptación de los términos actualizados.",
    "terms_conditions_section_9": "9. Información de Contacto",
    "terms_conditions_paragraph_9": "Si tienes alguna pregunta o inquietud acerca de estos Términos y Condiciones, por favor contáctanos en soporte@cafesabrosos.com."
  },
  "en": {
    "version": "1.0.0",
    "terms_conditions_title": "Terms and Conditions",
    "terms_conditions_intro": "Welcome to Café Sabrosos! These Terms and Conditions set the rules and regulations for the use of our web application. By accessing or using our web application, you agree to comply with these terms.",
    "terms_conditions_section_1": "1. Introduction",
    "terms_conditions_paragraph_1": "These Terms and Conditions govern your use of our web application to place orders at Café Sabrosos. If you do not agree with any part of these terms, you must not use our web application.",
    "terms_conditions_section_2": "2. Account Registration",
    "terms_conditions_paragraph_2": "To use certain features of our web application, you may need to create an account. You are responsible for maintaining the confidentiality of your account information and for all activities that occur under your account. You may also register using external providers like Google. By doing so, you agree that we may collect and use the information provided by such provider in accordance with our Privacy Policy.",
    "terms_conditions_section_3": "3. Orders and Payments",
    "terms_conditions_paragraph_3": "When placing an order, you agree to provide accurate information about the items you wish to purchase and your contact details. Payments must be made according to the available payment methods. We reserve the right to cancel any order if we suspect fraudulent activity.",
    "terms_conditions_section_4": "4. Order Pickup",
    "terms_conditions_paragraph_4": "If you choose to pick up your order, please do so at the specified time. Café Sabrosos is not responsible for delays or issues with the pickup process.",
    "terms_conditions_section_5": "5. Cancellations and Modifications",
    "terms_conditions_paragraph_5": "Orders can be modified or canceled before preparation begins. Once an order is in preparation, it cannot be canceled or modified. Please contact us as soon as possible if you need to make changes.",
    "terms_conditions_section_6": "6. User Conduct",
    "terms_conditions_paragraph_6": "You agree to use our web application legally and not engage in any activity that may harm our services, disrupt the user experience, or violate applicable laws.",
    "terms_conditions_section_7": "7. Privacy Policy",
    "terms_conditions_paragraph_7": "Your privacy is important to us. Please review our Privacy Policy to understand how we collect, use, and protect your personal information.",
    "terms_conditions_section_8": "8. Changes to Terms",
    "terms_conditions_paragraph_8": "We may update these Terms and Conditions from time to time. Any changes will be posted on this page, and your continued use of our web application constitutes acceptance of the updated terms.",
    "terms_conditions_section_9": "9. Contact Information",
    "terms_conditions_paragraph_9": "If you have any questions or concerns regarding these Terms and Conditions, please contact us at support@cafesabrosos.com."
  },
  "pt": {
    "version": "1.0.0",
    "terms_conditions_title": "Termos e Condições",
    "terms_conditions_intro": "Bem-vindo ao Café Sabrosos! Estes Termos e Condições estabelecem as regras e regulamentos para o uso de nossa aplicação web. Ao acessar ou utilizar nossa aplicação web, você concorda em cumprir estes termos.",
    "terms_conditions_section_1": "1. Introdução",
    "terms_conditions_paragraph_1": "Estes Termos e Condições regem seu uso de nossa aplicação web para fazer pedidos no Café Sabrosos. Se você não concorda com alguma parte destes termos, não deve utilizar nossa aplicação web.",
    "terms_conditions_section_2": "2. Registro de Conta",
    "terms_conditions_paragraph_2": "Para utilizar certas funções de nossa aplicação web, pode ser necessário criar uma conta. Você é responsável por manter a confidencialidade das informações da sua conta e por todas as atividades que ocorram sob sua conta. Você também pode se registrar usando provedores externos como o Google. Ao fazer isso, você concorda que coletamos e usamos as informações fornecidas por esse provedor, de acordo com nossa Política de Privacidade.",
    "terms_conditions_section_3": "3. Pedidos e Pagamentos",
    "terms_conditions_paragraph_3": "Ao fazer um pedido, você concorda em fornecer informações precisas sobre os itens que deseja comprar e seus dados de contato. Os pagamentos devem ser feitos de acordo com os métodos de pagamento disponíveis. Reservamos o direito de cancelar qualquer pedido se suspeitarmos de atividade fraudulenta.",
    "terms_conditions_section_4": "4. Coleta de Pedidos",
    "terms_conditions_paragraph_4": "Se você optar por retirar seu pedido, por favor, faça isso no horário especificado. O Café Sabrosos não se responsabiliza por atrasos ou problemas com o processo de coleta.",
    "terms_conditions_section_5": "5. Cancelamentos e Modificações",
    "terms_conditions_paragraph_5": "Os pedidos podem ser modificados ou cancelados antes do início da preparação. Uma vez que um pedido está em preparação, não pode ser cancelado ou modificado. Por favor, entre em contato conosco o mais rápido possível se precisar fazer alterações.",
    "terms_conditions_section_6": "6. Conduta do Usuário",
    "terms_conditions_paragraph_6": "Você concorda em usar nossa aplicação web de forma legal e não participar de nenhuma atividade que possa danificar nossos serviços, interromper a experiência do usuário ou violar as leis aplicáveis.",
    "terms_conditions_section_7": "7. Política de Privacidade",
    "terms_conditions_paragraph_7": "Sua privacidade é importante para nós. Por favor, revise nossa Política de Privacidade para entender como coletamos, usamos e protegemos suas informações pessoais.",
    "terms_conditions_section_8": "8. Alterações nos Termos",
    "terms_conditions_paragraph_8": "Podemos atualizar estes Termos e Condições de tempos em tempos. Quaisquer alterações serão publicadas nesta página, e seu uso contínuo de nossa aplicação web constitui aceitação dos termos atualizados.",
    "terms_conditions_section_9": "9. Informações de Contato",
    "terms_conditions_paragraph_9": "Se você tiver alguma dúvida ou preocupação sobre estes Termos e Condições, entre em contato conosco em suporte@cafesabrosos.com."
  },
  "de": {
    "version": "1.0.0",
    "terms_conditions_title": "Allgemeine Geschäftsbedingungen",
    "terms_conditions_intro": "Willkommen bei Café Sabrosos! Diese Allgemeinen Geschäftsbedingungen legen die Regeln und Vorschriften für die Nutzung unserer Webanwendung fest. Durch den Zugriff auf oder die Nutzung unserer Webanwendung stimmen Sie zu, diese Bedingungen einzuhalten.",
    "terms_conditions_section_1": "1. Einführung",
    "terms_conditions_paragraph_1": "Diese Allgemeinen Geschäftsbedingungen regeln Ihre Nutzung unserer Webanwendung zur Bestellung bei Café Sabrosos. Wenn Sie mit einem Teil dieser Bedingungen nicht einverstanden sind, dürfen Sie unsere Webanwendung nicht nutzen.",
    "terms_conditions_section_2": "2. Kontoanmeldung",
    "terms_conditions_paragraph_2": "Um bestimmte Funktionen unserer Webanwendung nutzen zu können, müssen Sie möglicherweise ein Konto erstellen. Sie sind verantwortlich für die Vertraulichkeit Ihrer Kontoinformationen und für alle Aktivitäten, die unter Ihrem Konto stattfinden. Sie können sich auch über externe Anbieter wie Google registrieren. Durch die Nutzung dieses Dienstes stimmen Sie zu, dass wir die von diesem Anbieter bereitgestellten Informationen gemäß unserer Datenschutzrichtlinie erfassen und verwenden.",
    "terms_conditions_section_3": "3. Bestellungen und Zahlungen",
    "terms_conditions_paragraph_3": "Beim Aufgeben einer Bestellung stimmen Sie zu, genaue Informationen zu den Artikeln, die Sie kaufen möchten, und Ihren Kontaktdaten bereitzustellen. Zahlungen müssen gemäß den verfügbaren Zahlungsmethoden erfolgen. Wir behalten uns das Recht vor, jede Bestellung zu stornieren, wenn wir betrügerische Aktivitäten vermuten.",
    "terms_conditions_section_4": "4. Abholung von Bestellungen",
    "terms_conditions_paragraph_4": "Wenn Sie sich entscheiden, Ihre Bestellung abzuholen, tun Sie dies bitte zur angegebenen Zeit. Café Sabrosos haftet nicht für Verzögerungen oder Probleme im Abholprozess.",
    "terms_conditions_section_5": "5. Stornierungen und Änderungen",
    "terms_conditions_paragraph_5": "Bestellungen können geändert oder storniert werden, bevor die Zubereitung beginnt. Sobald eine Bestellung in Vorbereitung ist, kann sie nicht mehr storniert oder geändert werden. Bitte kontaktieren Sie uns so schnell wie möglich, wenn Sie Änderungen vornehmen müssen.",
    "terms_conditions_section_6": "6. Benutzerverhalten",
    "terms_conditions_paragraph_6": "Sie stimmen zu, unsere Webanwendung legal zu nutzen und sich nicht an Aktivitäten zu beteiligen, die unsere Dienstleistungen schädigen, die Benutzererfahrung stören oder gegen geltendes Recht verstoßen.",
    "terms_conditions_section_7": "7. Datenschutzrichtlinie",
    "terms_conditions_paragraph_7": "Ihre Privatsphäre ist uns wichtig. Bitte überprüfen Sie unsere Datenschutzrichtlinie, um zu verstehen, wie wir Ihre persönlichen Informationen erfassen, verwenden und schützen.",
    "terms_conditions_section_8": "8. Änderungen der Bedingungen",
    "terms_conditions_paragraph_8": "Wir können diese Allgemeinen Geschäftsbedingungen von Zeit zu Zeit aktualisieren. Änderungen werden auf dieser Seite veröffentlicht, und Ihre fortgesetzte Nutzung unserer Webanwendung stellt die Akzeptanz der aktualisierten Bedingungen dar.",
    "terms_conditions_section_9": "9. Kontaktinformationen",
    "terms_conditions_paragraph_9": "Wenn Sie Fragen oder Bedenken zu diesen Allgemeinen Geschäftsbedingungen haben, kontaktieren Sie uns bitte unter support@cafesabrosos.com."
  },
  "fr": {
    "version": "1.0.0",
    "terms_conditions_title": "Conditions Générales",
    "terms_conditions_intro": "Bienvenue chez Café Sabrosos ! Ces Conditions Générales établissent les règles et réglementations pour l'utilisation de notre application web. En accédant ou en utilisant notre application web, vous acceptez de respecter ces conditions.",
    "terms_conditions_section_1": "1. Introduction",
    "terms_conditions_paragraph_1": "Ces Conditions Générales régissent votre utilisation de notre application web pour passer des commandes chez Café Sabrosos. Si vous n'êtes pas d'accord avec une partie de ces conditions, vous ne devez pas utiliser notre application web.",
    "terms_conditions_section_2": "2. Inscription du Compte",
    "terms_conditions_paragraph_2": "Pour utiliser certaines fonctionnalités de notre application web, vous devrez peut-être créer un compte. Vous êtes responsable de la confidentialité des informations de votre compte et de toutes les activités qui se produisent sous votre compte. Vous pouvez également vous inscrire en utilisant des fournisseurs externes comme Google. En faisant cela, vous acceptez que nous collections et utilisions les informations fournies par ce fournisseur, conformément à notre Politique de Confidentialité.",
    "terms_conditions_section_3": "3. Commandes et Paiements",
    "terms_conditions_paragraph_3": "En passant une commande, vous acceptez de fournir des informations précises sur les articles que vous souhaitez acheter et vos coordonnées. Les paiements doivent être effectués selon les méthodes de paiement disponibles. Nous nous réservons le droit d'annuler toute commande si nous suspectons une activité frauduleuse.",
    "terms_conditions_section_4": "4. Ramassage des Commandes",
    "terms_conditions_paragraph_4": "Si vous choisissez de ramasser votre commande, veuillez le faire à l'heure spécifiée. Café Sabrosos n'est pas responsable des retards ou des problèmes liés au processus de ramassage.",
    "terms_conditions_section_5": "5. Annulations et Modifications",
    "terms_conditions_paragraph_5": "Les commandes peuvent être modifiées ou annulées avant le début de la préparation. Une fois qu'une commande est en préparation, elle ne peut être annulée ni modifiée. Veuillez nous contacter dès que possible si vous devez apporter des modifications.",
    "terms_conditions_section_6": "6. Comportement des Utilisateurs",
    "terms_conditions_paragraph_6": "Vous acceptez d'utiliser notre application web de manière légale et de ne pas participer à des activités pouvant nuire à nos services, perturber l'expérience utilisateur ou violer les lois applicables.",
    "terms_conditions_section_7": "7. Politique de Confidentialité",
    "terms_conditions_paragraph_7": "Votre vie privée est importante pour nous. Veuillez consulter notre Politique de Confidentialité pour comprendre comment nous collectons, utilisons et protégeons vos informations personnelles.",
    "terms_conditions_section_8": "8. Changements des Conditions",
    "terms_conditions_paragraph_8": "Nous pouvons mettre à jour ces Conditions Générales de temps à autre. Toute modification sera publiée sur cette page, et votre utilisation continue de notre application web constitue l'acceptation des conditions mises à jour.",
    "terms_conditions_section_9": "9. Informations de Contact",
    "terms_conditions_paragraph_9": "Si vous avez des questions ou des préoccupations concernant ces Conditions Générales, veuillez nous contacter à support@cafesabrosos.com."
  }
}
